Revit 2027 API
StructuralSectionGeneralT.GetWebThicknessInHeightCenter Method
 Returns thickness of web measured in the 0.5 * height,
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetWebThicknessInHeightCenter()
Public Function GetWebThicknessInHeightCenter As Double
public:
double GetWebThicknessInHeightCenter()
member GetWebThicknessInHeightCenter : unit -> float
Return Value
Double
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace